app/controllers/api/v1/locations_controller.rb

INSERT INTO "locations" ("latitude", "longitude", "vehicle_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["latitude", "20.23"], ["longitude", "-0.56"], ["vehicle_id", 2], ["created_at", "2017-08-16 16:47:33.824292"], ["updated_at", "2017-08-16 16:47:33.824292"]]
INSERT INTO "vehicles" ("vehicle_identifier", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["vehicle_identifier", "abc"], ["created_at", "2017-08-16 16:47:13.384103"], ["updated_at", "2017-08-16 16:47:13.384103"]]
---
  def create
    # Se guarda la coordenada y la relacion en la tabla de enlace, luego con el proceso asincrono (delay) se guarda el dato adicional
    # esto inserta un registro en la tabla delayed_jobs, el cual se ejecutara
    # al colocar el siguiente comando en la consola rake jobs:work
    sent_at = params[:sent_at].present? ? params[:sent_at] : DateTime.now
    @location = @vehicle.locations.create(locations_params)