app/controllers/vehicles_controller.rb

SELECT "locations".* FROM "locations" WHERE "locations"."vehicle_id" = $1  [["vehicle_id", 1]]
---
  def show
    # Se muestran solo las ultimas 10
    @locations = Location.where(vehicle_id: @vehicle.id).order("id desc").limit(10)