app/controllers/vehicles_controller.rb

SELECT "vehicles".* FROM "vehicles"
SELECT  "locations".* FROM "locations" INNER JOIN "waypoints" ON "locations"."id" = "waypoints"."location_id" WHERE "waypoints"."vehicle_id" = $1  ORDER BY "locations"."id" DESC LIMIT 1  [["vehicle_id", 4]]
---
  def show
    # Ultima ubicacion por cada vehiculo
    @vehicles = Vehicle.all
    @vehicles_last_location = @vehicles.map{ |v| v.locations.last }.compact